Revit 2027 API
MEPAnalyticalSegment.GetSegment Method
 Gets the analytical segment from the Subelement
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MEPAnalyticalSegment GetSegment(
	Subelement subElem
)
Public Shared Function GetSegment (
	subElem As Subelement
) As MEPAnalyticalSegment
public:
static MEPAnalyticalSegment^ GetSegment(
	Subelement^ subElem
)
static member GetSegment :
        subElem : Subelement -> MEPAnalyticalSegment
Parameters
subElem Subelement
 The subelement of the analytical segment.
Return Value
MEPAnalyticalSegment
Exceptions
Exception | Condition
ArgumentException |  The subelement must be a valid analytical segment subelement.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace